[
  {
    "id": 1,
    "questionText": "What is the musical style widely considered a symbol of Brazilian national identity, often credited with popularizing Brazilian music globally?",
    "answerOptions": [
      { "id": "A", "answerText": "Samba", "isCorrect": true },
      { "id": "B", "answerText": "Forró", "isCorrect": false },
      { "id": "C", "answerText": "Bossa Nova", "isCorrect": false },
      { "id": "D", "answerText": "Axé", "isCorrect": false }
    ],
    "learnMoreText": "Samba is Brazil's most recognized musical style, celebrated globally for its infectious rhythms and Carnival association. Originating in Rio de Janeiro, it blends African and European influences to create a unifying, collaborative music genre that symbolizes national identity and joy.",
    "imageURL": "../assets/images/quiz1/1.jpg",
    "altText": "Female Carnival dancers in green sequined dresses, beaded jewelry, and large feathers."
  },
  {
    "id": 2,
    "questionText": "Which Panamanian city hosts one of the country's most famous carnivals, celebrated for its vibrant music and parades?",
    "answerOptions": [
      { "id": "A", "answerText": "Bocas del Toro", "isCorrect": false },
      { "id": "B", "answerText": "Las Tablas", "isCorrect": true },
      { "id": "C", "answerText": "Boquete", "isCorrect": false },
      { "id": "D", "answerText": "Colón", "isCorrect": false }
    ],
    "learnMoreText": "The annual Carnival of Las Tablas in Panama is famous for its fierce, yet friendly, competition between two rival street groups, Calle Arriba and Calle Abajo. This intense but festive rivalry involves elaborate floats and costumes, fostering collective town pride and ensuring the celebration remains vibrant and collaborative.",
    "imageURL": "../assets/images/quiz1/2.jpg",
    "altText": "Fireworks over a nighttime Carnival crowd with costumed performers on floats."
  },
  {
    "id": 3,
    "questionText": "The Tatreez is a specific style of traditional embroidery. In which country of the Middle East is this technique most closely associated with the national clothing called a Thobe?",
    "answerOptions": [
      { "id": "A", "answerText": "Jordan", "isCorrect": false },
      { "id": "B", "answerText": "Lebanon", "isCorrect": false },
      { "id": "C", "answerText": "Saudi Arabia", "isCorrect": false },
      { "id": "D", "answerText": "Palestine", "isCorrect": true }
    ],
    "learnMoreText": "Tatreez is the intricate traditional cross-stitch embroidery used to decorate the Palestinian Thobe (dress). This beautiful art form, passed down through generations, is a visual language where the specific motifs and colors communicate the wearer's village and history, serving as a powerful symbol of cultural identity.",
    "imageURL": "../assets/images/quiz1/3.jpg",
    "altText": "A handmade cross-stitched embroidery with flowers and leaves."
  },
  {
    "id": 4,
    "questionText": "Which Indigenous language, spoken in present-day Mexico, is the source of common English words like \"chocolate\" and \"avocado\"?",
    "answerOptions": [
      { "id": "A", "answerText": "Yucatec Maya", "isCorrect": false },
      { "id": "B", "answerText": "Nahuatl", "isCorrect": true },
      { "id": "C", "answerText": "Otomi", "isCorrect": false },
      { "id": "D", "answerText": "Tzeltal", "isCorrect": false }
    ],
    "learnMoreText": "Nahuatl is the Indigenous language historically spoken by the Aztecs and still spoken in present-day Mexico. It has gifted English many common words, such as \"chili\" and \"tomato\". Recognizing its influence celebrates the enduring cultural and linguistic contributions of Mesoamerican heritage.",
    "imageURL": "../assets/images/quiz1/4.jpg",
    "altText": "A ceremonial performer in Aztec-style regalia with feathered headdress and turquoise face paint."
  },
  {
    "id": 5,
    "questionText": "This Canadian dish is a celebrated cultural staple that consists of french fries and cheese curds topped with a brown gravy. What is the name of this food?",
    "answerOptions": [
      { "id": "A", "answerText": "Tourtière", "isCorrect": false },
      { "id": "B", "answerText": "Nanaimo Bar", "isCorrect": false },
      { "id": "C", "answerText": "Poutine", "isCorrect": true },
      { "id": "D", "answerText": "BeaverTails", "isCorrect": false }
    ],
    "learnMoreText": "Poutine is a quintessential Canadian cultural staple that originated in Quebec. This simple, rich dish is celebrated from coast to coast, representing a fun, unifying piece of Canadian culinary identity. Despite its popularity now, the dish was initially considered a simple, low-brow \"mess\" when it first appeared in rural Quebec diners in the 1950s.",
    "imageURL": "../assets/images/quiz1/5.jpg",
    "altText": "A person holding a bowl of french fries topped with cheese curds and gravy."
  },
  {
    "id": 6,
    "questionText": "The traditional art of repairing broken pottery with gold lacquer, celebrating the object's history and imperfections, is known as Kintsugi. Which country is this practice from?",
    "answerOptions": [
      { "id": "A", "answerText": "South Korea", "isCorrect": false },
      { "id": "B", "answerText": "Japan", "isCorrect": true },
      { "id": "C", "answerText": "Vietnam", "isCorrect": false },
      { "id": "D", "answerText": "China", "isCorrect": false }
    ],
    "learnMoreText": "Kintsugi is the traditional Japanese art of repairing broken pottery with lacquer mixed with gold. This encouraging practice embraces the object's damage and history, viewing breakage as part of the story. The gold highlights the fault lines, transforming imperfection into an object of unique beauty and strength.",
    "imageURL": "../assets/images/quiz1/6.png",
    "altText": "A ceramic tea bowl repaired with gold lacquer in the cracks."
  },
  {
    "id": 7,
    "questionText": "What Mediterranean country is known for its Slow Food movement, which was started in 1986 to preserve traditional regional cooking and encourage local agricultural diversity?",
    "answerOptions": [
      { "id": "A", "answerText": "France", "isCorrect": false },
      { "id": "B", "answerText": "Spain", "isCorrect": false },
      { "id": "C", "answerText": "Greece", "isCorrect": false },
      { "id": "D", "answerText": "Italy", "isCorrect": true }
    ],
    "learnMoreText": "The Slow Food movement, started in Italy, encourages people to reject the modern speed of fast food and preserve local culinary traditions, regional diversity, and sustainable agriculture. This collaborative effort promotes appreciation for heritage and enjoying food as a source of community and pleasure.",
    "imageURL": "../assets/images/quiz1/7.jpg",
    "altText": "Mediterranean cliffside coastline with brightly coloured buildings, and small boats in the sea."
  },

  {
    "id": 8,
    "questionText": "Held on Chinese/Lunar New Year's Eve, the Reunion Dinner is the central event of the holiday. What core concept does this ceremonial gathering primarily represent?",
    "answerOptions": [
      { "id": "A", "answerText": "New job opportunities", "isCorrect": false },
      { "id": "B", "answerText": "Luck in business", "isCorrect": false },
      { "id": "C", "answerText": "Importance of family & togetherness", "isCorrect": true },
      { "id": "D", "answerText": "The end of winter", "isCorrect": false }
    ],
    "learnMoreText": "The Lunar New Year's Eve Reunion Dinner (Nian Ye Fan) is the most significant meal of the year. It represents family unity, gratitude, and remembrance of ancestors. This act of togetherness reinforces familial bonds and sets an encouraging tone for the new year, embodying hope and collective well-being.",
    "imageURL": "../assets/images/quiz1/8.jpg",
    "altText": "Lunar New Year red envelopes hanging from a mandarin orange tree."
  },
  {
    "id": 9,
    "questionText": "Norwegians celebrate a holiday on June 23rd called Jonsok, which is called what in the English-speaking world?",
    "answerOptions": [
      { "id": "A", "answerText": "Constitution Day", "isCorrect": false },
      { "id": "B", "answerText": "The Winter Solstice", "isCorrect": false },
      { "id": "C", "answerText": "Midsummer's Eve", "isCorrect": true },
      { "id": "D", "answerText": "The Harvest Festival", "isCorrect": false }
    ],
    "learnMoreText": "Midsummer's Eve is an annual celebration of the summer solstice, historically marking the longest day and shortest night of the year, particularly in Northern Europe. Celebrations often involve lighting large bonfires, dancing, and gathering outdoors. It is a time for people to celebrate light, fertility, and community before the long winter returns.",
    "imageURL": "../assets/images/quiz1/9.jpg",
    "altText": "A large daytime bonfire next to a body of water with the sun on the horizon in the distance."
  },
  {
    "id": 10,
    "questionText": "Known as a symbol of elegance, what is the name of the traditional Vietnamese garment featuring a long tunic worn over trousers?",
    "answerOptions": [
      { "id": "A", "answerText": "Ao Dai", "isCorrect": true },
      { "id": "B", "answerText": "Hanbok", "isCorrect": false },
      { "id": "C", "answerText": "Kimono", "isCorrect": false },
      { "id": "D", "answerText": "Cheongsam", "isCorrect": false }
    ],
    "learnMoreText": "The Ao Dai is Vietnam's national garment, recognized for its elegant, high-collared tunic with side vents worn gracefully over long trousers. As a powerful symbol of Vietnamese identity and feminine beauty, it represents cultural pride and is often worn during formal occasions, celebrating the country's rich heritage.",
    "imageURL": "../assets/images/quiz1/10.jpg",
    "altText": "A woman in a pink full-length gown and conical hat stands on a boat during the day."
  }
]
